<a href="https://colab.research.google.com/github/paratesai316/FDS-Google-Colabs/blob/main/RA2411056010288_unit4.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
a = [1,7,2]
myvar = pd.Series(a,index=['x','y','z'])
print(myvar)

x    1
y    7
z    2
dtype: int64

In [ ]:
import pandas as pd
calories = {"day1": 420, "day2": 380, "day3": 390}
myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [ ]:
import pandas as pd
lst = ['Foundations','of','Datascience','is','a','very','interesting','subject']
df=pd.DataFrame(lst)
print(df)

             0
0  Foundations
1           of
2  Datascience
3           is
4            a
5         very
6  interesting
7      subject

In [ ]:
import pandas as pd
lst = ['Foundations','of','Datascience','is','a','very','interesting','subject']
data = {"calories":[420,380,390],"duration":[50,40,45]}
df = pd.DataFrame(data)
print(df)
df1 = pd.DataFrame(lst)
print(df1)

   calories  duration
0       420        50
1       380        40
2       390        45
             0
0  Foundations
1           of
2  Datascience
3           is
4            a
5         very
6  interesting
7      subject

In [ ]:
import pandas as pd
player_list = [['M S Dhoni',36,75,5428000],
               ['A B D Villers',38,74,3428000],
               ['V Kohli',31,70,8428000],
               ['S Smith',34,80,4428000],
               ['C Gayle',40,100,4528000],
               ['J Root',33,72,7028000],
               ['K Peterson',42,85,2528000]]

df1 = pd.DataFrame(player_list,columns=['Name','Age','Weight','Salary'])
print(df1,"\n\n")
df2 = df.iloc[0:4]
print(df2,"\n\n")
df3 = df.loc[:,'Name':'Age']
print(df3)

            Name  Age  Weight   Salary
0      M S Dhoni   36      75  5428000
1  A B D Villers   38      74  3428000
2        V Kohli   31      70  8428000
3        S Smith   34      80  4428000
4        C Gayle   40     100  4528000
5         J Root   33      72  7028000
6     K Peterson   42      85  2528000


            Name  Age  Weight   Salary
0      M S Dhoni   36      75  5428000
1  A B D Villers   38      74  3428000
2        V Kohli   31      70  8428000
3        S Smith   34      80  4428000


            Name  Age
0      M S Dhoni   36
1  A B D Villers   38
2        V Kohli   31
3        S Smith   34
4        C Gayle   40
5         J Root   33
6     K Peterson   42

In [ ]:
import pandas as pd

data = {'Name':['Jai','Princi','Gaurav','Anuj'],
        'Age':[27,24,22,32],
        'Address':['Delhi','Kanpur','Allahabad','Kannauj'],
        'Qualification':['Msc','MA','MCA','Phd']}

df = pd.DataFrame(data)
print(df,"\n\n")
print(df.loc[1:3,['Name','Qualification']],"\n\n")
print(df.loc[0:1,'Name':'Address'],"\n\n")

     Name  Age    Address Qualification
0     Jai   27      Delhi           Msc
1  Princi   24     Kanpur            MA
2  Gaurav   22  Allahabad           MCA
3    Anuj   32    Kannauj           Phd


     Name Qualification
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd


     Name  Age Address
0     Jai   27   Delhi
1  Princi   24  Kanpur

In [ ]:
import pandas as pd
data = {'name': ['jai','Prince','Gaurav','Anuj'],
        'Height': [5.1,6.2,5.1,5.2],
        'Qualification': ['Msc','MA','Msc','Msc']}
df = pd.DataFrame(data)
address = ['Delhi','Kanpur','Allahabad','Kannauj']
df['Address']=address
print(df)

     name  Height Qualification    Address
0     jai     5.1           Msc      Delhi
1  Prince     6.2            MA     Kanpur
2  Gaurav     5.1           Msc  Allahabad
3    Anuj     5.2           Msc    Kannauj

In [ ]:
import pandas as pd
import numpy as np
df1 = {'Name':['PersonA','PersonB','PersonC','PersonD','PersonE'],
       'Maths':[69,73,84,56,94],
       'Science':[95,62,78,76,67]}
df1 = pd.DataFrame(df1)
df1['Average'] = df1[['Maths', 'Science']].mean(axis=1)
print(df1,"\n\n")
print(df1[(df1['Maths'] > 60)  & (df1['Science'] > 75)],"\n\n")
print("Student with highest averages: ")
print(df1.iloc[np.argmax(df1['Average'])])

      Name  Maths  Science  Average
0  PersonA     69       95     82.0
1  PersonB     73       62     67.5
2  PersonC     84       78     81.0
3  PersonD     56       76     66.0
4  PersonE     94       67     80.5


      Name  Maths  Science  Average
0  PersonA     69       95     82.0
2  PersonC     84       78     81.0


Student with highest averages:
Name       PersonA
Maths           69
Science         95
Average       82.0
Name: 0, dtype: object

In [ ]:
import pandas as pd
import numpy as np
data = {
    'Department' : ['HR','IT','HR','Finance','IT','Finance'],
    'Employee' : ['Alice','Bob','Charlie','David','Eve','Frank'],
    'Salary' : [50000,70000,55000,60000,75000,65000],
    'Experience' : [2,5,3,4,6,5]
  }

df = pd.DataFrame(data)
print(df,"\n\n")

print("Average salary for each department\n")
grouped1 = df.groupby('Department')['Salary'].mean()
print(grouped1,"\n\n")

print("Total salary paid for each department\n")
grouped2 = df.groupby('Department')['Salary'].sum()
print(grouped2,"\n\n")

print("Aggregate for mean, sum, count, std dev in same table")
grouped3 = df.groupby('Department')['Salary'].agg(['mean','sum','count','std'])
print(grouped3,"\n\n")

print("Different aggregations for different columns")
grouped4 = df.groupby('Department').agg({
    'Salary' : ['mean','max'],
    'Experience' : ['mean','min']
})
print(grouped4,"\n\n")

  Department Employee  Salary  Experience
0         HR    Alice   50000           2
1         IT      Bob   70000           5
2         HR  Charlie   55000           3
3    Finance    David   60000           4
4         IT      Eve   75000           6
5    Finance    Frank   65000           5


Average salary for each department

Department
Finance    62500.0
HR         52500.0
IT         72500.0
Name: Salary, dtype: float64


Total salary paid for each department

Department
Finance    125000
HR         105000
IT         145000
Name: Salary, dtype: int64


Aggregate for mean, sum, count, std dev in same table
               mean     sum  count          std
Department
Finance     62500.0  125000      2  3535.533906
HR          52500.0  105000      2  3535.533906
IT          72500.0  145000      2  3535.533906


Different aggregations for different columns
             Salary        Experience
               mean    max       mean min
Department
Finance     62500.0  65000        4.5   4
HR          52500.0  55000        2.5   2
IT          72500.0  75000        5.5   5

In [ ]:
data_extended = {
    'Department' : ['HR','IT','HR','Finance','IT','Finance','HR','IT'],
    'Location' : ['NY', 'SF', 'NY', 'NY', 'SF', 'SF', 'SF', 'NY'],
    'Salary' : [50000,70000,55000,60000,75000,65000,58000, 72000],
    'Experience' : [2,5,3,4,6,5,4,5]
}
df_extended = pd.DataFrame(data_extended)
print(df_extended,"\n\n")


grouped1 = df_extended.groupby(['Department','Location'])['Salary'].mean()
print(grouped1,"\n\n")

grouped2 = df.groupby('Department').agg(
    avg_salary = ('Salary','mean'),
    total_salary = ('Salary','sum'),
    employee_count = ('Employee','count'),
    max_experience = ('Experience','max')
)
print(grouped2,"\n\n")

def salary_range (series) :
  return series.max() - series.min()

grouped3 = df.groupby('Department').agg({
    'Salary' : [salary_range,'mean'],
    'Experience' : ['mean','std']
})
print(grouped3, "\n\n")

  Department Location  Salary  Experience
0         HR       NY   50000           2
1         IT       SF   70000           5
2         HR       NY   55000           3
3    Finance       NY   60000           4
4         IT       SF   75000           6
5    Finance       SF   65000           5
6         HR       SF   58000           4
7         IT       NY   72000           5


Department  Location
Finance     NY          60000.0
            SF          65000.0
HR          NY          52500.0
            SF          58000.0
IT          NY          72000.0
            SF          72500.0
Name: Salary, dtype: float64


            avg_salary  total_salary  employee_count  max_experience
Department
Finance        62500.0        125000               2               5
HR             52500.0        105000               2               3
IT             72500.0        145000               2               6


                 Salary          Experience
           salary_range     mean       mean       std
Department
Finance            5000  62500.0        4.5  0.707107
HR                 5000  52500.0        2.5  0.707107
IT                 5000  72500.0        5.5  0.707107